Repository: hiro5791/HexEditor
Catalog: src/HexEditor.App/Strings/*/Resources.resw
Source language: en
Languages: ar, cs, de, el, es, fa, fr, hu, id, it, ja, ja_jp, ko, pl, pt, ro, ru, th, tr, uk, vi, zh_hans, zh_hant

# SetDesc_search_regex_timeLimit
source: Time limit per chunk for regular expressions that use backtracking (lookaround or backreferences). From 0.1 to 60 seconds.
ar: الحد الزمني لكل جزء للتعبيرات العادية التي تستخدم التراجع (lookaround أو المراجع الخلفية). من 0.1 إلى 60 ثانية.
cs: Časový limit pro každý blok u regulárních výrazů se zpětným vyhledáváním (lookaround nebo zpětné odkazy). 0,1 až 60 sekund.
de: Zeitlimit pro Block für reguläre Ausdrücke mit Backtracking (Lookaround oder Rückverweise). 0,1 bis 60 Sekunden.
el: Χρονικό όριο ανά τμήμα για κανονικές εκφράσεις που χρησιμοποιούν οπισθοδρόμηση (lookaround ή αναφορές προς τα πίσω). Από 0,1 έως 60 δευτερόλεπτα.
es: Límite de tiempo por bloque para expresiones regulares con retroceso (búsqueda alrededor o referencias inversas). De 0,1 a 60 segundos.
fa: محدودیت زمانی هر قطعه برای عبارت‌های باقاعده‌ای که از عقب‌گرد (lookaround یا ارجاع به عقب) استفاده می‌کنند. از 0.1 تا 60 ثانیه.
fr: Limite de temps par bloc pour les expressions régulières utilisant le retour arrière (assertions ou références arrière). De 0,1 à 60 secondes.
hu: Blokkonkénti időkorlát a visszalépést használó reguláris kifejezésekhez (előre-/hátratekintés vagy visszahivatkozás). 0,1 és 60 másodperc között.
id: Batas waktu per potongan untuk ekspresi reguler yang menggunakan backtracking (lookaround atau backreference). Dari 0,1 hingga 60 detik.
it: Limite di tempo per blocco per le espressioni regolari che usano il backtracking (lookaround o riferimenti all'indietro). Da 0,1 a 60 secondi.
ja: 後方参照・先読み・後読みを使う正規表現の、チャンクごとの時間の上限。0.1〜60 秒。
ko: 역추적(전후방 탐색 또는 역참조)을 사용하는 정규식의 청크당 시간 제한입니다. 0.1~60초.
pl: Limit czasu na fragment dla wyrażeń regularnych używających nawracania (lookaround lub odwołań wstecznych). Od 0,1 do 60 sekund.
pt: Limite de tempo por bloco para expressões regulares que usam backtracking (lookaround ou referências anteriores). De 0,1 a 60 segundos.
ro: Limita de timp pe fragment pentru expresiile regulate care utilizează backtracking (lookaround sau referințe înapoi). Între 0,1 și 60 de secunde.
th: ขีดจำกัดเวลาต่อชิ้นข้อมูลสำหรับนิพจน์ทั่วไปที่ใช้การย้อนรอย (lookaround หรือ backreference) ตั้งแต่ 0.1 ถึง 60 วินาที
tr: Geri izleme (çevreye bakma veya geri başvurular) kullanan normal ifadeler için parça başına süre sınırı. 0,1 ile 60 saniye arası.
uk: Обмеження часу на блок для регулярних виразів із поверненням (перегляд уперед/назад або зворотні посилання). Від 0,1 до 60 секунд.
vi: Giới hạn thời gian cho mỗi khối đối với biểu thức chính quy dùng quay lui (lookaround hoặc tham chiếu ngược). Từ 0,1 đến 60 giây.
zh_hans: 使用回溯（环视或反向引用）的正则表达式在每个块上的时间限制。0.1 到 60 秒。
zh_hant: 使用回溯（環顧或反向參考）之規則運算式每個區塊的時間限制。0.1 到 60 秒。

# Set_search_mismatch_minRepeat
source: Repetitions that end a non-matching range
ar: التكرارات التي تُنهي نطاقًا غير مطابق
cs: Počet opakování, který ukončí neshodující se rozsah
de: Wiederholungen, die einen nicht übereinstimmenden Bereich beenden
el: Επαναλήψεις που τερματίζουν μια περιοχή χωρίς αντιστοιχία
es: Repeticiones que terminan un rango no coincidente
fa: تعداد تکرارهایی که محدودهٔ نامنطبق را پایان می‌دهد
fr: Répétitions qui terminent une plage non correspondante
hu: Nem egyező tartományt lezáró ismétlések
id: Pengulangan yang mengakhiri rentang tidak cocok
it: Ripetizioni che chiudono un intervallo non corrispondente
ja: 一致しない範囲を終える繰り返しの回数
ko: 불일치 범위를 끝내는 반복 횟수
pl: Powtórzenia kończące niezgodny zakres
pt: Repetições que encerram um intervalo sem correspondência
ro: Repetări care încheie un interval nepotrivit
th: จำนวนการทำซ้ำที่สิ้นสุดช่วงที่ไม่ตรงกัน
tr: Eşleşmeyen aralığı bitiren yineleme sayısı
uk: Кількість повторень, що завершують невідповідний діапазон
vi: Số lần lặp kết thúc phạm vi không khớp
zh_hans: 结束不匹配范围的重复次数
zh_hant: 結束不符合範圍的重複次數

# SetDesc_search_mismatch_minRepeat
source: In "Find what is not the pattern", a range ends where the pattern repeats this many times. From 1 to 65,536.
ar: في «البحث عما لا يطابق النمط»، ينتهي النطاق حيث يتكرر النمط هذا العدد من المرات. من 1 إلى 65,536.
cs: V příkazu „Najít, co neodpovídá vzoru“ rozsah končí tam, kde se vzor tolikrát opakuje. 1 až 65 536.
de: Bei „Suchen, was nicht dem Muster entspricht“ endet ein Bereich dort, wo sich das Muster so oft wiederholt. 1 bis 65.536.
el: Στην «Εύρεση ό,τι δεν είναι το μοτίβο», μια περιοχή τελειώνει εκεί όπου το μοτίβο επαναλαμβάνεται τόσες φορές. Από 1 έως 65.536.
es: En “Buscar lo que no coincide con el patrón”, un rango termina donde el patrón se repite esta cantidad de veces. De 1 a 65 536.
fa: در «یافتن آنچه الگو نیست»، محدوده جایی پایان می‌یابد که الگو این تعداد بار تکرار شود. از 1 تا 65,536.
fr: Dans « Rechercher ce qui ne correspond pas au motif », une plage se termine là où le motif se répète ce nombre de fois. De 1 à 65 536.
hu: „A mintától eltérő részek keresése” esetén egy tartomány ott ér véget, ahol a minta ennyiszer ismétlődik. 1 és 65 536 között.
id: Pada “Temukan yang bukan pola”, rentang berakhir di tempat pola berulang sebanyak ini. Dari 1 hingga 65.536.
it: In “Trova ciò che non è il modello”, un intervallo termina dove il modello si ripete questo numero di volte. Da 1 a 65.536.
ja: 「一致しない箇所を探す」のすべて検索で、パターンがこの回数以上続く位置で範囲を終えます。1〜65,536。
ko: "패턴이 아닌 부분 찾기"에서 패턴이 이 횟수만큼 반복되는 위치에서 범위가 끝납니다. 1~65,536.
pl: W funkcji „Znajdź to, co nie jest wzorcem” zakres kończy się tam, gdzie wzorzec powtarza się tyle razy. Od 1 do 65 536.
pt: Em “Localizar o que não é o padrão”, um intervalo termina onde o padrão se repete esse número de vezes. De 1 a 65.536.
ro: În „Găsire a ceea ce nu corespunde modelului”, un interval se încheie acolo unde modelul se repetă de atâtea ori. Între 1 și 65.536.
th: ใน “ค้นหาสิ่งที่ไม่ใช่รูปแบบ” ช่วงจะสิ้นสุดที่ตำแหน่งที่รูปแบบทำซ้ำตามจำนวนครั้งนี้ ตั้งแต่ 1 ถึง 65,536
tr: "Desen olmayanı bul" içinde, desenin bu kadar kez yinelendiği yerde aralık biter. 1 ile 65.536 arası.
uk: У режимі «Знайти те, що не відповідає шаблону» діапазон закінчується там, де шаблон повторюється стільки разів. Від 1 до 65 536.
vi: Trong “Tìm phần không theo mẫu”, một phạm vi kết thúc tại nơi mẫu lặp lại đủ số lần này. Từ 1 đến 65.536.
zh_hans: 在“查找不符合模式的内容”中，模式重复达到此次数的位置即结束范围。1 到 65,536。
zh_hant: 在「尋找不符合模式的內容」中，範圍會在模式重複此次數之處結束。1 到 65,536。

# Set_search_multiFile_parallelism
source: Files searched at the same time
ar: الملفات التي يتم البحث فيها في الوقت نفسه
cs: Současně prohledávané soubory
de: Gleichzeitig durchsuchte Dateien
el: Αρχεία που αναζητούνται ταυτόχρονα
es: Archivos buscados a la vez
fa: فایل‌هایی که هم‌زمان جستجو می‌شوند
fr: Fichiers recherchés simultanément
hu: Egyszerre keresett fájlok
id: File yang dicari bersamaan
it: File cercati contemporaneamente
ja: 同時に検索するファイルの数
ko: 동시에 검색할 파일 수
pl: Pliki przeszukiwane jednocześnie
pt: Arquivos pesquisados ao mesmo tempo
ro: Fișiere căutate simultan
th: จำนวนไฟล์ที่ค้นหาพร้อมกัน
tr: Aynı anda aranan dosya sayısı
uk: Файлів, що переглядаються одночасно
vi: Số tệp được tìm cùng lúc
zh_hans: 同时搜索的文件数
zh_hant: 同時搜尋的檔案數

# SetDesc_search_multiFile_parallelism
source: Number of files that "Search in files" reads in parallel. On a hard disk (HDD), 1 is recommended. From 1 to 16.
ar: عدد الملفات التي يقرأها «البحث في الملفات» بالتوازي. على القرص الثابت (HDD)، يوصى بالقيمة 1. من 1 إلى 16.
cs: Počet souborů, které „Hledat v souborech“ čte paralelně. Na pevném disku (HDD) se doporučuje 1. 1 až 16.
de: Anzahl der Dateien, die „In Dateien suchen“ parallel liest. Auf einer Festplatte (HDD) wird 1 empfohlen. 1 bis 16.
el: Αριθμός αρχείων που διαβάζει παράλληλα η «Αναζήτηση σε αρχεία». Σε σκληρό δίσκο (HDD) συνιστάται το 1. Από 1 έως 16.
es: Número de archivos que “Buscar en archivos” lee en paralelo. En un disco duro (HDD) se recomienda 1. De 1 a 16.
fa: تعداد فایل‌هایی که «جستجو در فایل‌ها» به‌طور موازی می‌خواند. روی دیسک سخت (HDD) مقدار 1 توصیه می‌شود. از 1 تا 16.
fr: Nombre de fichiers que « Rechercher dans les fichiers » lit en parallèle. Sur un disque dur (HDD), 1 est recommandé. De 1 à 16.
hu: A „Keresés fájlokban” által párhuzamosan olvasott fájlok száma. Merevlemezen (HDD) 1 ajánlott. 1 és 16 között.
id: Jumlah file yang dibaca “Cari di file” secara paralel. Pada hard disk (HDD), disarankan 1. Dari 1 hingga 16.
it: Numero di file che “Cerca nei file” legge in parallelo. Su un disco rigido (HDD) è consigliato 1. Da 1 a 16.
ja: 複数ファイル検索で並列に読むファイルの数。HDD では 1 をおすすめします。1〜16。
ko: "파일에서 검색"이 병렬로 읽는 파일 수입니다. 하드 디스크(HDD)에서는 1을 권장합니다. 1~16.
pl: Liczba plików odczytywanych równolegle przez funkcję „Szukaj w plikach”. Na dysku twardym (HDD) zalecana jest wartość 1. Od 1 do 16.
pt: Número de arquivos que “Pesquisar em arquivos” lê em paralelo. Em um disco rígido (HDD), recomenda-se 1. De 1 a 16.
ro: Numărul de fișiere pe care „Căutare în fișiere” le citește în paralel. Pe un hard disk (HDD) se recomandă 1. Între 1 și 16.
th: จำนวนไฟล์ที่ “ค้นหาในไฟล์” อ่านพร้อมกัน สำหรับฮาร์ดดิสก์ (HDD) แนะนำ 1 ตั้งแต่ 1 ถึง 16
tr: "Dosyalarda ara" işleminin paralel okuduğu dosya sayısı. Sabit diskte (HDD) 1 önerilir. 1 ile 16 arası.
uk: Кількість файлів, які «Пошук у файлах» читає паралельно. Для жорсткого диска (HDD) рекомендовано 1. Від 1 до 16.
vi: Số tệp mà “Tìm trong tệp” đọc song song. Với ổ cứng (HDD), nên dùng 1. Từ 1 đến 16.
zh_hans: “在文件中搜索”并行读取的文件数。在硬盘（HDD）上建议设为 1。1 到 16。
zh_hant: 「在檔案中搜尋」平行讀取的檔案數。若為硬碟（HDD），建議設為 1。1 到 16。

# MultiFile_AddFolder.Content
source: Add
ar: إضافة
cs: Přidat
de: Hinzufügen
el: Προσθήκη
es: Agregar
fa: افزودن
fr: Ajouter
hu: Hozzáadás
id: Tambah
it: Aggiungi
ja: 追加
ko: 추가
pl: Dodaj
pt: Adicionar
ro: Adăugare
th: เพิ่ม
tr: Ekle
uk: Додати
vi: Thêm
zh_hans: 添加
zh_hant: 新增

# MultiFile_BrowseFolder.Content
source: Browse...
ar: استعراض...
cs: Procházet...
de: Durchsuchen...
el: Αναζήτηση...
es: Examinar...
fa: مرور...
fr: Parcourir...
hu: Tallózás...
id: Telusuri...
it: Sfoglia...
ja: 参照...
ko: 찾아보기...
pl: Przeglądaj...
pt: Procurar...
ro: Răsfoire...
th: เรียกดู...
tr: Gözat...
uk: Огляд...
vi: Duyệt...
zh_hans: 浏览...
zh_hant: 瀏覽...

# MultiFile_RemoveFolder.Content
source: Remove
ar: إزالة
cs: Odebrat
de: Entfernen
el: Κατάργηση
es: Quitar
fa: حذف
fr: Supprimer
hu: Eltávolítás
id: Hapus
it: Rimuovi
ja: 削除
ko: 제거
pl: Usuń
pt: Remover
ro: Eliminare
th: ลบ
tr: Kaldır
uk: Видалити
vi: Xóa
zh_hans: 删除
zh_hant: 移除

# MultiFile_Backup.Content
source: Make a backup (.bak) before replacing
ar: إنشاء نسخة احتياطية (.bak) قبل الاستبدال
cs: Před nahrazením vytvořit zálohu (.bak)
de: Vor dem Ersetzen eine Sicherung (.bak) erstellen
el: Δημιουργία αντιγράφου ασφαλείας (.bak) πριν από την αντικατάσταση
es: Crear una copia de seguridad (.bak) antes de reemplazar
fa: تهیهٔ پشتیبان (.bak) پیش از جایگزینی
fr: Créer une sauvegarde (.bak) avant de remplacer
hu: Biztonsági másolat (.bak) készítése csere előtt
id: Buat cadangan (.bak) sebelum mengganti
it: Crea un backup (.bak) prima di sostituire
ja: 置換の前にバックアップ (.bak) を作る
ko: 바꾸기 전에 백업(.bak) 만들기
pl: Utwórz kopię zapasową (.bak) przed zamianą
pt: Fazer um backup (.bak) antes de substituir
ro: Creare copie de rezervă (.bak) înainte de înlocuire
th: สร้างข้อมูลสำรอง (.bak) ก่อนแทนที่
tr: Değiştirmeden önce yedek (.bak) oluştur
uk: Створювати резервну копію (.bak) перед заміною
vi: Tạo bản sao lưu (.bak) trước khi thay thế
zh_hans: 替换前创建备份（.bak）
zh_hant: 取代前建立備份（.bak）

# MultiFile_ClearReadOnly.Content
source: Replace read-only files too (clear the attribute)
ar: استبدال الملفات للقراءة فقط أيضًا (مسح السمة)
cs: Nahradit i soubory jen pro čtení (zrušit atribut)
de: Auch schreibgeschützte Dateien ersetzen (Attribut entfernen)
el: Αντικατάσταση και αρχείων μόνο για ανάγνωση (απαλοιφή του χαρακτηριστικού)
es: Reemplazar también los archivos de solo lectura (quitar el atributo)
fa: جایگزینی فایل‌های فقط خواندنی نیز (پاک کردن ویژگی)
fr: Remplacer aussi les fichiers en lecture seule (supprimer l'attribut)
hu: Írásvédett fájlok cseréje is (az attribútum törlésével)
id: Ganti juga file baca-saja (hapus atributnya)
it: Sostituisci anche nei file di sola lettura (rimuove l'attributo)
ja: 読み取り専用属性を外して置換する
ko: 읽기 전용 파일도 바꾸기(특성 해제)
pl: Zamieniaj także w plikach tylko do odczytu (usuń atrybut)
pt: Substituir também arquivos somente leitura (remover o atributo)
ro: Înlocuire și în fișierele doar în citire (eliminare atribut)
th: แทนที่ไฟล์แบบอ่านอย่างเดียวด้วย (ล้างแอตทริบิวต์)
tr: Salt okunur dosyalarda da değiştir (özniteliği kaldır)
uk: Замінювати й у файлах лише для читання (знімати атрибут)
vi: Thay thế cả tệp chỉ đọc (xóa thuộc tính)
zh_hans: 也替换只读文件（清除该属性）
zh_hant: 也取代唯讀檔案（清除屬性）

# MultiFile_Cancel.Content
source: Cancel
ar: إلغاء
cs: Zrušit
de: Abbrechen
el: Άκυρο
es: Cancelar
fa: لغو
fr: Annuler
hu: Mégse
id: Batal
it: Annulla
ja: キャンセル
ko: 취소
pl: Anuluj
pt: Cancelar
ro: Anulare
th: ยกเลิก
tr: İptal
uk: Скасувати
vi: Hủy
zh_hans: 取消
zh_hant: 取消

# MultiFile_Search.Content
source: Search
ar: بحث
cs: Hledat
de: Suchen
el: Αναζήτηση
es: Buscar
fa: جستجو
fr: Rechercher
hu: Keresés
id: Cari
it: Cerca
ja: 検索
ko: 검색
pl: Szukaj
pt: Pesquisar
ro: Căutare
th: ค้นหา
tr: Ara
uk: Знайти
vi: Tìm kiếm
zh_hans: 搜索
zh_hant: 搜尋

# MultiFile_RunReplace.Content
source: Replace
ar: استبدال
cs: Nahradit
de: Ersetzen
el: Αντικατάσταση
es: Reemplazar
fa: جایگزینی
fr: Remplacer
hu: Csere
id: Ganti
it: Sostituisci
ja: 置換を実行
ko: 바꾸기
pl: Zamień
pt: Substituir
ro: Înlocuire
th: แทนที่
tr: Değiştir
uk: Замінити
vi: Thay thế
zh_hans: 替换
zh_hant: 取代

# MultiFile_Confirm_Title
source: Replace in files?
ar: هل تريد الاستبدال في الملفات؟
cs: Nahradit v souborech?
de: In Dateien ersetzen?
el: Αντικατάσταση σε αρχεία;
es: ¿Reemplazar en archivos?
fa: جایگزینی در فایل‌ها انجام شود؟
fr: Remplacer dans les fichiers ?
hu: Csere a fájlokban?
id: Ganti di file?
it: Sostituire nei file?
ja: ファイルを置換しますか?
ko: 파일에서 바꾸시겠습니까?
pl: Zamienić w plikach?
pt: Substituir em arquivos?
ro: Înlocuiți în fișiere?
th: แทนที่ในไฟล์หรือไม่
tr: Dosyalarda değiştirilsin mi?
uk: Виконати заміну у файлах?
vi: Thay thế trong tệp?
zh_hans: 要在文件中替换吗？
zh_hant: 要在檔案中取代嗎？

# MultiFile_Confirm_Body
source: {1} matches in {0} files will be replaced and the files will be saved directly. {2} This can't be undone (files open in tabs are replaced in the editor instead, and can be undone there).
ar: سيتم استبدال {1} تطابقات في {0} ملفات وحفظ الملفات مباشرةً. {2} لا يمكن التراجع عن ذلك (الملفات المفتوحة في علامات التبويب يتم الاستبدال فيها داخل المحرر بدلاً من ذلك، ويمكن التراجع هناك).
cs: Shody ({1}) v souborech ({0}) budou nahrazeny a soubory budou přímo uloženy. {2} Tuto akci nelze vrátit zpět (soubory otevřené na kartách se místo toho nahradí v editoru a tam je lze vrátit zpět).
de: {1} Treffer in {0} Dateien werden ersetzt und die Dateien direkt gespeichert. {2} Dies kann nicht rückgängig gemacht werden (in Registerkarten geöffnete Dateien werden stattdessen im Editor ersetzt und können dort rückgängig gemacht werden).
el: Θα αντικατασταθούν {1} αντιστοιχίες σε {0} αρχεία και τα αρχεία θα αποθηκευτούν απευθείας. {2} Αυτή η ενέργεια δεν μπορεί να αναιρεθεί (τα αρχεία που είναι ανοιχτά σε καρτέλες αντικαθίστανται στον επεξεργαστή και μπορούν να αναιρεθούν εκεί).
es: Se reemplazarán {1} coincidencias en {0} archivos y los archivos se guardarán directamente. {2} Esta acción no se puede deshacer (los archivos abiertos en pestañas se reemplazan en el editor, donde se puede deshacer).
fa: {1} مورد منطبق در {0} فایل جایگزین می‌شود و فایل‌ها مستقیماً ذخیره می‌شوند. {2} این کار برگشت‌پذیر نیست (فایل‌هایی که در زبانه‌ها باز هستند به‌جای آن در ویرایشگر جایگزین می‌شوند و در آنجا قابل واگرد هستند).
fr: {1} correspondances dans {0} fichiers seront remplacées et les fichiers seront enregistrés directement. {2} Cette action est irréversible (les fichiers ouverts dans des onglets sont remplacés dans l'éditeur, où l'action peut être annulée).
hu: {0} fájlban {1} találat lesz lecserélve, és a fájlok közvetlenül mentésre kerülnek. {2} Ez nem vonható vissza (a lapokon megnyitott fájlokban a csere a szerkesztőben történik, és ott visszavonható).
id: {1} kecocokan di {0} file akan diganti dan file akan langsung disimpan. {2} Tindakan ini tidak dapat dibatalkan (file yang terbuka di tab diganti di editor, dan dapat dibatalkan di sana).
it: Verranno sostituite {1} corrispondenze in {0} file e i file verranno salvati direttamente. {2} L'operazione non può essere annullata (i file aperti nelle schede vengono invece sostituiti nell'editor e lì è possibile annullare).
ja: {0} ファイルの {1} 件を置換し、ファイルを直接書き換えて保存します。{2} この操作は元に戻せません (タブで開いているファイルはエディタ上で置換し、そこで元に戻せます)。
ko: 파일 {0}개에서 일치 항목 {1}개를 바꾸고 파일을 직접 저장합니다. {2} 이 작업은 취소할 수 없습니다(탭에서 열려 있는 파일은 편집기에서 바꾸므로 거기서 실행 취소할 수 있습니다).
pl: Dopasowania ({1}) w plikach ({0}) zostaną zamienione, a pliki zostaną zapisane bezpośrednio. {2} Tej operacji nie można cofnąć (pliki otwarte w kartach są zamieniane w edytorze i tam można to cofnąć).
pt: {1} correspondências em {0} arquivos serão substituídas e os arquivos serão salvos diretamente. {2} Isso não pode ser desfeito (arquivos abertos em guias são substituídos no editor e podem ser desfeitos lá).
ro: Potrivirile ({1}) din {0} fișiere vor fi înlocuite, iar fișierele vor fi salvate direct. {2} Această acțiune nu poate fi anulată (fișierele deschise în file sunt înlocuite în schimb în editor și pot fi anulate acolo).
th: รายการที่ตรงกัน {1} รายการใน {0} ไฟล์จะถูกแทนที่และไฟล์จะถูกบันทึกโดยตรง {2} การดำเนินการนี้เลิกทำไม่ได้ (ไฟล์ที่เปิดอยู่ในแท็บจะถูกแทนที่ในตัวแก้ไขแทน และเลิกทำได้ที่นั่น)
tr: {0} dosyadaki {1} eşleşme değiştirilecek ve dosyalar doğrudan kaydedilecek. {2} Bu işlem geri alınamaz (sekmelerde açık dosyalar bunun yerine düzenleyicide değiştirilir ve orada geri alınabilir).
uk: Збіги ({1}) у файлах ({0}) буде замінено, а файли — збережено безпосередньо. {2} Цю дію не можна скасувати (у файлах, відкритих у вкладках, заміна виконується в редакторі, і там її можна скасувати).
vi: {1} kết quả khớp trong {0} tệp sẽ được thay thế và các tệp sẽ được lưu trực tiếp. {2} Không thể hoàn tác thao tác này (tệp đang mở trong tab sẽ được thay thế trong trình soạn thảo, và có thể hoàn tác ở đó).
zh_hans: 将替换 {0} 个文件中的 {1} 个匹配项，并直接保存这些文件。{2}此操作无法撤消（在选项卡中打开的文件会改为在编辑器中替换，可在编辑器中撤消）。
zh_hant: 將取代 {0} 個檔案中的 {1} 個符合項目，並直接儲存檔案。{2} 此操作無法復原（在索引標籤中開啟的檔案則會改在編輯器中取代，並可在該處復原）。

# MultiFile_Confirm_Backup
source: A backup (.bak) of each file is made first.
ar: يتم إنشاء نسخة احتياطية (.bak) من كل ملف أولاً.
cs: Nejdříve se vytvoří záloha (.bak) každého souboru.
de: Von jeder Datei wird zuerst eine Sicherung (.bak) erstellt.
el: Δημιουργείται πρώτα αντίγραφο ασφαλείας (.bak) κάθε αρχείου.
es: Primero se crea una copia de seguridad (.bak) de cada archivo.
fa: ابتدا از هر فایل پشتیبان (.bak) تهیه می‌شود.
fr: Une sauvegarde (.bak) de chaque fichier est d'abord créée.
hu: Előbb minden fájlról biztonsági másolat (.bak) készül.
id: Cadangan (.bak) setiap file dibuat terlebih dahulu.
it: Prima viene creato un backup (.bak) di ogni file.
ja: 各ファイルのバックアップ (.bak) を先に作ります。
ko: 먼저 각 파일의 백업(.bak)을 만듭니다.
pl: Najpierw tworzona jest kopia zapasowa (.bak) każdego pliku.
pt: Primeiro é feito um backup (.bak) de cada arquivo.
ro: Mai întâi se creează o copie de rezervă (.bak) a fiecărui fișier.
th: จะสร้างข้อมูลสำรอง (.bak) ของแต่ละไฟล์ก่อน
tr: Önce her dosyanın bir yedeği (.bak) oluşturulur.
uk: Спочатку створюється резервна копія (.bak) кожного файлу.
vi: Bản sao lưu (.bak) của mỗi tệp sẽ được tạo trước.
zh_hans: 会先为每个文件创建备份（.bak）。
zh_hant: 會先為每個檔案建立備份（.bak）。

# MultiFile_Confirm_NoBackup
source: No backup is made.
ar: لا يتم إنشاء نسخة احتياطية.
cs: Záloha se nevytvoří.
de: Es wird keine Sicherung erstellt.
el: Δεν δημιουργείται αντίγραφο ασφαλείας.
es: No se crea ninguna copia de seguridad.
fa: پشتیبان تهیه نمی‌شود.
fr: Aucune sauvegarde n'est créée.
hu: Nem készül biztonsági másolat.
id: Tidak ada cadangan yang dibuat.
it: Non viene creato alcun backup.
ja: バックアップは作りません。
ko: 백업을 만들지 않습니다.
pl: Kopia zapasowa nie jest tworzona.
pt: Nenhum backup é feito.
ro: Nu se creează nicio copie de rezervă.
th: จะไม่สร้างข้อมูลสำรอง
tr: Yedek oluşturulmaz.
uk: Резервна копія не створюється.
vi: Không tạo bản sao lưu.
zh_hans: 不创建备份。
zh_hant: 不會建立備份。

# MultiFile_Confirm_Replace
source: Replace and save
ar: الاستبدال والحفظ
cs: Nahradit a uložit
de: Ersetzen und speichern
el: Αντικατάσταση και αποθήκευση
es: Reemplazar y guardar
fa: جایگزینی و ذخیره
fr: Remplacer et enregistrer
hu: Csere és mentés
id: Ganti dan simpan
it: Sostituisci e salva
ja: 置換して保存する
ko: 바꾸고 저장
pl: Zamień i zapisz
pt: Substituir e salvar
ro: Înlocuire și salvare
th: แทนที่และบันทึก
tr: Değiştir ve kaydet
uk: Замінити й зберегти
vi: Thay thế và lưu
zh_hans: 替换并保存
zh_hant: 取代並儲存

# MultiFile_Confirm_Cancel
source: Don't replace
ar: عدم الاستبدال
cs: Nenahrazovat
de: Nicht ersetzen
el: Να μην γίνει αντικατάσταση
es: No reemplazar
fa: جایگزین نشود
fr: Ne pas remplacer
hu: Nincs csere
id: Jangan ganti
it: Non sostituire
ja: やめる
ko: 바꾸지 않음
pl: Nie zamieniaj
pt: Não substituir
ro: Nu înlocuiți
th: ไม่แทนที่
tr: Değiştirme
uk: Не замінювати
vi: Không thay thế
zh_hans: 不替换
zh_hant: 不要取代

# MultiFile_Depth.PlaceholderText
source: Depth (no limit)
ar: العمق (بلا حد)
cs: Hloubka (bez omezení)
de: Tiefe (unbegrenzt)
el: Βάθος (χωρίς όριο)
es: Profundidad (sin límite)
fa: عمق (بدون محدودیت)
fr: Profondeur (illimitée)
hu: Mélység (nincs korlát)
id: Kedalaman (tanpa batas)
it: Profondità (nessun limite)
ja: 深さ (制限なし)
ko: 깊이(제한 없음)
pl: Głębokość (bez limitu)
pt: Profundidade (sem limite)
ro: Adâncime (fără limită)
th: ความลึก (ไม่จำกัด)
tr: Derinlik (sınırsız)
uk: Глибина (без обмеження)
vi: Độ sâu (không giới hạn)
zh_hans: 深度（无限制）
zh_hant: 深度（無限制）

# MultiFile_DepthInvalid
source: Enter the depth as a whole number.
ar: أدخل العمق كعدد صحيح.
cs: Zadejte hloubku jako celé číslo.
de: Geben Sie die Tiefe als ganze Zahl ein.
el: Εισαγάγετε το βάθος ως ακέραιο αριθμό.
es: Escribe la profundidad como número entero.
fa: عمق را به‌صورت عدد صحیح وارد کنید.
fr: Entrez la profondeur sous forme de nombre entier.
hu: A mélységet egész számként adja meg.
id: Masukkan kedalaman sebagai bilangan bulat.
it: Immetti la profondità come numero intero.
ja: 深さは整数で入力してください。
ko: 깊이를 정수로 입력하세요.
pl: Wprowadź głębokość jako liczbę całkowitą.
pt: Insira a profundidade como um número inteiro.
ro: Introduceți adâncimea ca număr întreg.
th: ป้อนความลึกเป็นจำนวนเต็ม
tr: Derinliği tam sayı olarak girin.
uk: Введіть глибину цілим числом.
vi: Hãy nhập độ sâu là số nguyên.
zh_hans: 请以整数输入深度。
zh_hant: 請以整數輸入深度。

# MultiFile_Exclude.PlaceholderText
source: Exclude (e.g. .git;node_modules)
ar: الاستبعاد (مثل .git;node_modules)
cs: Vyloučit (např. .git;node_modules)
de: Ausschließen (z. B. .git;node_modules)
el: Εξαίρεση (π.χ. .git;node_modules)
es: Excluir (p. ej. .git;node_modules)
fa: استثنا (مثلاً .git;node_modules)
fr: Exclure (par ex. .git;node_modules)
hu: Kizárás (pl. .git;node_modules)
id: Kecualikan (mis. .git;node_modules)
it: Escludi (ad es. .git;node_modules)
ja: 除外するマスク (例: .git;node_modules)
ko: 제외(예: .git;node_modules)
pl: Wyklucz (np. .git;node_modules)
pt: Excluir (por exemplo, .git;node_modules)
ro: Excludere (de ex. .git;node_modules)
th: ไม่รวม (เช่น .git;node_modules)
tr: Hariç tut (ör. .git;node_modules)
uk: Виключити (наприклад, .git;node_modules)
vi: Loại trừ (ví dụ: .git;node_modules)
zh_hans: 排除（例如 .git;node_modules）
zh_hant: 排除（例如 .git;node_modules）
